<?php

use Illuminate\Database\Seeder;

class LogCategorySeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('log_categories')->insert([

            // login
            ['name' => 'تسجيل الدخول'],
            ['name' => 'تسجيل الخروج'],

            // create permissions
            ['name' => 'إضافة مستخدم'],
            ['name' => 'تعديل مستخدم'],
            ['name' => 'حذف مستخدم'],
            ['name' => ' تحديد صلاحيات'],

            // call
            ['name' => 'إضافة اتصال'],
            ['name' => 'تعديل اتصال'],
            ['name' => 'حذف اتصال'],

            // tasks
            ['name' => 'إضافة مهمة'],
            ['name' => 'تعديل مهمة'],
            ['name' => 'حذف مهمة'],

            // city
            ['name' => 'إضافة مدينة'],
            ['name' => 'تعديل مدينة'],
            ['name' => 'حذف مدينة'],

            // country
            ['name' => 'إضافة دولة'],
            ['name' => 'تعديل دولة'],
            ['name' => 'حذف دولة'],

            // disease
            ['name' => 'إضافة مرض'],
            ['name' => 'تعديل مرض'],
            ['name' => 'حذف مرض'],

            // educational institution
            ['name' => 'إضافة المؤسسة التعليمية'],
            ['name' => 'تعديل المؤسسة التعليمية'],
            ['name' => 'حذف المؤسسة التعليمية'],
            ['name' => 'قبول المؤسسة التعليمية'],

            // file type
            ['name' => 'إضافة اسم المرفق'],
            ['name' => 'تعديل  اسم المرفق'],
            ['name' => 'حذف  اسم المرفق'],
            ['name' => 'قبول  اسم المرفق'],

            // funded institution
            ['name' => 'إضافة جهة مرشحة'],
            ['name' => 'تعديل جهة مرشحة'],
            ['name' => 'حذف جهة مرشحة'],
            ['name' => 'قبول جهة مرشحة'],

            // house ownership
            ['name' => 'إضافة ملكية السكن'],
            ['name' => 'تعديل ملكية السكن'],
            ['name' => 'حذف ملكية السكن'],

            // houseRoofs
            ['name' => 'إضافة نوع السكن'],
            ['name' => 'تعديل نوع السكن'],
            ['name' => 'حذف نوع السكن'],

            // houseStatuses
            ['name' => 'إضافة وضع السكن'],
            ['name' => 'تعديل وضع السكن'],
            ['name' => 'حذف وضع السكن'],

            // incomeTypes
            ['name' => 'إضافة جهة الدخل '],
            ['name' => 'تعديل جهة الدخل'],
            ['name' => 'حذف جهة الدخل'],

            // jobTypes
            ['name' => 'إضافة نوع العمل'],
            ['name' => 'تعديل نوع العمل'],
            ['name' => 'حذف نوع العمل'],

            // qualifications
            ['name' => 'إضافة مؤهل علمي'],
            ['name' => 'تعديل مؤهل علمي'],
            ['name' => 'حذف مؤهل علمي'],

            // relationships
            ['name' => 'إضافة صلة القرابة'],
            ['name' => 'تعديل صلة القرابة'],
            ['name' => 'حذف صلة القرابة'],
            ['name' => 'قبول صلة القرابة'],

            // universitySpecialties
            ['name' => 'إضافة التخصص الجامعي'],
            ['name' => 'تعديل التخصص الجامعي'],
            ['name' => 'حذف التخصص الجامعي'],
            ['name' => 'قبول التخصص الجامعي'],

            // visitReasons
            ['name' => 'إضافة سبب  الزيارة'],
            ['name' => 'تعديل سبب  الزيارة'],
            ['name' => 'حذف سبب  الزيارة'],
            ['name' => 'قبول سبب  الزيارة'],

            // settings
            ['name' => 'إدارة الإعدادات العامة'],

            // profile
            ['name' => 'تعديل المعلومات الشخصية'],

            // recipients
            ['name' => 'إدارة الاستمارات'],
            ['name' => 'إضافة استمارة'],
            ['name' => 'تعديل استمارة'],
            ['name' => 'حذف استمارة'],
            ['name' => 'سبب ابطال الاستمارة'],
            ['name' => 'حذف مرفق استمارة'],


            // recipientProjects
            ['name' => 'إضافة تصنيف مشروع'],
            ['name' => 'تعديل تصنيف مشروع'],

            // nameTranslations
            ['name' => 'إضافة ترجمة'],
            ['name' => 'تعديل ترجمة'],
            ['name' => 'حذف ترجمة'],

            // department
            ['name' => 'إضافة قسم'],
            ['name' => 'تعديل قسم'],
            ['name' => 'حذف قسم'],

            // expenses
            ['name' => 'حذف صرفية'],
            ['name' => 'استيراد صرفية'],
            ['name' => 'ابلاغ صرفية'],
            ['name' => 'تسليم صرفية'],

            // expenseDetails
            ['name' => 'حذف تفاصيل الصرفية'],
            ['name' => 'ابلاغ حذف تفاصيل الصرفية'],
            ['name' => 'تسليم تفاصيل الصرفية'],

            // expensePrices
            ['name' => 'إضافة سعر صرف'],
            ['name' => 'تعديل سعر صرف'],
            ['name' => 'حذف سعر صرف'],

            // expensePrices
            ['name' => 'تعديل كفيل'],
            ['name' => 'حذف كفيل'],

            // familyType
            ['name' => 'إضافة تصنيف الحالة'],
            ['name' => 'تعديل تصنيف الحالة'],
            ['name' => 'حذف تصنيف الحالة'],

            // neighborhoods
            ['name' => 'إضافة حي'],
            ['name' => 'تعديل حي'],
            ['name' => 'حذف حي'],


            ['name' => 'إضافة زيارات عن طريق ملف اكسل'],

            // profile
            ['name' => 'إضافة مرفقات شخصية'],
            ['name' => 'حذف مرفقات شخصية'],

            // translation
            ['name' => 'إضافة ترجمة عن طريق ملف اكسل'],
            ['name' => 'إضافة زيارات ايتام عن طريق ملف اكسل'],

            // socialStatus
            ['name' => 'إضافة حالة اجتماعية'],
            ['name' => 'تعديل حالة اجتماعية'],
            ['name' => 'حذف حالة اجتماعية'],

            // QualificationLevel
            ['name' => 'إضافة مستوى تعليمي'],
            ['name' => 'تعديل مستوى تعليمي'],
            ['name' => 'حذف مستوى تعليمي'],

            // QualificationLevel
            ['name' => 'إضافة مستوى تعليمي'],
            ['name' => 'تعديل مستوى تعليمي'],
            ['name' => 'حذف مستوى تعليمي'],

            // studyLevel
            ['name' => 'إضافة مستوى جامعي'],
            ['name' => 'تعديل مستوى جامعي'],
            ['name' => 'حذف مستوى جامعي'],

            // studyPart
            ['name' => 'إضافة جهة الدراسة'],
            ['name' => 'تعديل جهة الدراسة'],
            ['name' => 'حذف جهة الدراسة'],

            // studyType
            ['name' => 'إضافة نوع دراسة'],
            ['name' => 'تعديل نوع دراسة'],
            ['name' => 'حذف نوع دراسة'],

            // familyStatus
            ['name' => 'إضافة وضع الحالة'],
            ['name' => 'تعديل وضع الحالة'],
            ['name' => 'حذف وضع الحالة'],

            // idType
            ['name' => 'إضافة نوع الوثيقة'],
            ['name' => 'تعديل نوع الوثيقة'],
            ['name' => 'حذف نوع الوثيقة'],

            // furnitureTypes
            ['name' => 'إضافة وضع الأثاث'],
            ['name' => 'تعديل وضع الأثاث'],
            ['name' => 'حذف وضع الأثاث'],


            ['name' => 'اضافه فرد المكفول'],
            ['name' => 'حذف فرد المكفول'],
            ['name' => 'حذف مصدر دخل المكفول'],
            ['name' => ' أرشيف  استماره'],
            ['name' => ' سجل  زيارات'],
            ['name' => ' اعتماد  استماره'],

            // Beneficiary institution
            ['name' => 'إضافة جهة مستفيدة'],
            ['name' => 'تعديل جهة مستفيدة'],
            ['name' => 'حذف جهة مستفيدة'],
            ['name' => 'قبول جهة مستفيدة'],
            ['name' => 'إضافة زوجات المكفول'],

            ['name' => 'إضافة جمعية'],
            ['name' => 'تعديل جمعية'],
            ['name' => 'حذف جمعية'],

            ['name' => 'إضافة مشروع'],
            ['name' => 'تعديل مشروع'],
            ['name' => 'حذف مشروع'],


            ['name' => 'إضافة صنف'],
            ['name' => 'تعديل صنف'],
            ['name' => 'حذف صنف'],

            ['name' => 'إضافة وحدة'],
            ['name' => 'تعديل وحدة'],
            ['name' => 'حذف وحدة'],

            ['name' => 'إضافة موسم'],
            ['name' => 'تعديل موسم'],
            ['name' => 'حذف موسم'],

            ['name' => 'إضافة جهة ترخيص'],
            ['name' => 'تعديل جهة ترخيص'],
            ['name' => 'حذف جهة ترخيص'],


            ['name' => 'إضافة فئة استهداف'],
            ['name' => 'تعديل فئة استهداف'],
            ['name' => 'حذف فئة استهداف'],

            ['name' => 'إضافة سبب مساعدة'],
            ['name' => 'تعديل سبب مساعدة'],
            ['name' => 'حذف سبب مساعدة'],

            ['name' => 'إضافة مساعدة طارئة'],
            ['name' => 'تعديل مساعدة طارئة'],
            ['name' => 'حذف مساعدة طارئة'],
            ['name' => 'قبول مساعدة طارئة'],
            ['name' => 'تسليم مساعدة طارئة'],

            ['name' => 'إضافة مساعدة'],
            ['name' => 'تعديل مساعدة'],
            ['name' => 'حذف مساعدة'],
            ['name' => 'قبول مساعدة'],
            ['name' => 'تسليم مساعدة'],
            ['name' => 'ارفاق افراد لمساعدة'],

            ['name' => 'إضافة مساعدة لفرد'],
            ['name' => 'تعديل مساعدة لفرد'],
            ['name' => 'حذف مساعدة لفرد'],
            ['name' => 'قبول مساعدة لفرد'],
            ['name' => 'تسليم مساعدة لفرد'],

        ]);
    }
}
